[["Junior Software Engineer - Back End", "OneMain Financial", "\nThey turn to us to help meet important financial needs, including debt consolidation, medical expenses, household bills and auto purchases.\n", "N/A"], ["Senior Software Engineer", "Growing Company", "\nGenerally, 4+ years as a professional software engineer.\nExpert understanding of server-side and client-side JavaScript and asynchronous JavaScript code.\n", "$130,000 - $160,000 a year"], ["Cloud Engineer", "Vanguard", "\nExperienced in Agile principle and Agile best practices Write great quality code with a drive for automated testing and validation.\n", "N/A"], ["Associate Programmer", "Sheetz", "\nThe Associate Programmer assists in the development of technology solutions as assigned by Applications and Development management.\n", "N/A"], ["Software Engineer", "NetApp", "\nResponsible for delivering an enterprise class NetApp software product.\nDevelops, modifies, and executes automated software test plans.\n", "N/A"], ["Associate Software Engineer", "ZM Financial Systems", "\nComplete documentation and procedures for installation and maintenance of software.\nGood communication (written and oral) and interpersonal skills.\n", "N/A"], ["Software Engineer – Int Software Engineer - Remote", "Publix", "\nWork effectively in a team environment by providing direction to newer software engineers, taking technical direction from architecture, technical leads, and…\n", "$81,640 - $133,445 a year"], ["Software Engineer", "TrueLearn", "\nCollaborate with the software development team to architect solutions to meet the requirements.\nEvaluate new software products, technologies, and provide…\n", "N/A"], ["Software Engineer", "WELLS FARGO BANK", "\nCollaborate and consult with technology colleagues, internal partners, and stakeholders.\nPresent recommendations for resolving issues or may escalate issues as…\n", "N/A"], ["Software Engineer II", "Microsoft", "\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.\n", "N/A"], ["Software Engineer", "LendingTree", "\n2+ yrs. of professional software engineering experience.\nThis position will be responsible for contributing to a team of backend engineers (APIs and systems…\n", "N/A"], ["Employee Technology Experience Software and Integration Engi...", "U.S. Bank", "\nImplement, integrate, and document software platforms through the REST API framework.\nBe involved in the development life cycle and perform definition and…\n", "$115,005 - $135,300 a year"], ["Software Engineer II", "Bank of America", "\nDevelopment of Online Banking application and java based backend system.\n3+ years of hands-on software development experience.\n", "N/A"], ["Software Engineer", "Microsoft", "\nCollaborate with colleagues including product owners, UX designers, ML Engineers/Researchers, data scientists and other engineers to create delightful and…\n", "N/A"], ["Associate Software Engineer", "Lowe's", "\nAssists with translating business requirements and specifications into code modules and software solutions with guidance from senior colleagues; provides…\n", "N/A"]]