[["Senior Software Engineer", "Growing Company", "\nGenerally, 4+ years as a professional software engineer.\nExpert understanding of server-side and client-side JavaScript and asynchronous JavaScript code.\n", "$130,000 - $160,000 a year"], ["Cloud Engineer", "Vanguard", "\nExperienced in Agile principle and Agile best practices Write great quality code with a drive for automated testing and validation.\n", "N/A"], ["Associate Programmer", "Sheetz", "\nThe Associate Programmer assists in the development of technology solutions as assigned by Applications and Development management.\n", "N/A"], ["Entry Level Software Engineer", "Revature", "\nAs a Revature Entry Level Software Engineer you will receive on-the-job-training to become an experienced software engineer.\n", "N/A"], ["Junior Software Engineer - Front End", "OneMain Financial", "\nStrong desire to learn the codebase, java script (Angular, Ionic, Node) based applications and services and improve coding skills.\nUp to 4% matching 401(k).\n", "N/A"], ["Junior J2EE Software Programmer", "TCS Tech", "\nIndependent and highly motivated individual with high impact communication and great problem-solving skills.\nThis position will interface with key stakeholders…\n", "N/A"], ["Software Engineer", "NetApp", "\nResponsible for delivering an enterprise class NetApp software product.\nDevelops, modifies, and executes automated software test plans.\n", "N/A"], ["Software Engineer – Int Software Engineer - Remote", "Publix", "\nWork effectively in a team environment by providing direction to newer software engineers, taking technical direction from architecture, technical leads, and…\n", "$81,640 - $133,445 a year"], ["Software Engineer", "WELLS FARGO BANK", "\nCollaborate and consult with technology colleagues, internal partners, and stakeholders.\nPresent recommendations for resolving issues or may escalate issues as…\n", "N/A"], ["Software Engineer II", "Microsoft", "\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.\n", "N/A"], ["Software Engineer (Only W2)", "Snowrelic INC", "\nDevelop high-quality codebase, participate in design discussions, execute development against design, and navigate complex codebase.\n", "$73,129 - $140,932 a year"], ["Employee Technology Experience Software and Integration Engi...", "U.S. Bank", "\nImplement, integrate, and document software platforms through the REST API framework.\nBe involved in the development life cycle and perform definition and…\n", "$115,005 - $135,300 a year"], ["Associate Software Engineer", "ZM Financial Systems", "\nComplete documentation and procedures for installation and maintenance of software.\nGood communication (written and oral) and interpersonal skills.\n", "N/A"], ["Software Engineer, Backend (Remote - North Carolina)", "BambooHR", "\nVersion control software, preferably Git.\nResearch technologies and engineer complete solutions to problems.\nPropose and implement performance optimizations and…\n", "$105,000 - $120,000 a year"], ["Associate Software Engineer", "Lowe's", "\nAssists with translating business requirements and specifications into code modules and software solutions with guidance from senior colleagues; provides…\n", "N/A"]]